/*************************************************************************
* *
* Problem: 
* *
*************************************************************************/
/*************************************************************************
* *
* 국민대학교 경영대학 경영정보학부 3학년 *
* 20190385 송규헌 *
* *
*************************************************************************/
#include <iostream>
#include <cstdlib>
#include <cmath>

using namespace std;

int main()
{
    int t;
    cin >> t;

    while (t--)
    {
        int n = 0;
        cin >> n;

        int arr[n];

        
        for (int i = 0; i < n; i++)
        {
            cin >> arr[i];
            cout<< (int)(arr[i] / (int)pow(10,(int)log10(arr[i]))) <<", ";
        }////////for

        // for (int i = 0; i < n; i++)
        // {
        //     cout<<arr[i]<<", ";
        // }
        cout << endl;
        
        
    }////////while

    return 0;
}